## Problem Statement

### Analyze the Federal Aviation Authority (FAA) dataset using Pandas 

1.    View:
    - Aircraft Manufacturer
    - State
    - Aircraft Model
    - Text Information
    - Flight Phase
    - Event Description Type
    - Fatal Flag
    
2. Clean the dataset and replace the fatal flag NaN with No

3. Find the different types of aircrafts and their occureneces in the dataset

4. Remove all observations where the aircraft names are not available

5. Display the observations where fatal flag is Yes

In [47]:
import pandas as pd

In [48]:
# read faa dataset

In [49]:
dataset = pd.read_csv('datasets/faa_ai_prelim.csv')

In [50]:
# view the dataset

In [51]:
dataset.shape

(83, 42)

In [52]:
# view the first 5 observations

In [53]:
dataset.head()

,UPDATED,ENTRY_DATE,EVENT_LCL_DATE,EVENT_LCL_TIME,LOC_CITY_NAME,LOC_STATE_NAME,LOC_CNTRY_NAME,RMK_TEXT,EVENT_TYPE_DESC,FSDO_DESC,...,PAX_INJ_NONE,PAX_INJ_MINOR,PAX_INJ_SERIOUS,PAX_INJ_FATAL,PAX_INJ_UNK,GRND_INJ_NONE,GRND_INJ_MINOR,GRND_INJ_SERIOUS,GRND_INJ_FATAL,GRND_INJ_UNK
0,No,19-FEB-16,19-FEB-16,00:45:00Z,MARSHVILLE,North Carolina,NaN,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",Accident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,No,19-FEB-16,18-FEB-16,23:55:00Z,TAVERNIER,Florida,NaN,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,Incident,FAA Miami FSDO-19,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,No,19-FEB-16,18-FEB-16,22:14:00Z,TRENTON,New Jersey,NaN,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",Incident,FAA Philadelphia FSDO-17,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,No,19-FEB-16,18-FEB-16,17:10:00Z,ASHEVILLE,North Carolina,NaN,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",Incident,FAA Charlotte FSDO-68,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,No,19-FEB-16,18-FEB-16,00:26:00Z,TALKEETNA,Alaska,NaN,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",Incident,FAA Anchorage FSDO-03,...,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
# view all the columns in the dataset

In [55]:
dataset.columns

Index(['UPDATED', 'ENTRY_DATE', 'EVENT_LCL_DATE', 'EVENT_LCL_TIME',
       'LOC_CITY_NAME', 'LOC_STATE_NAME', 'LOC_CNTRY_NAME', 'RMK_TEXT',
       'EVENT_TYPE_DESC', 'FSDO_DESC', 'REGIST_NBR', 'FLT_NBR', 'ACFT_OPRTR',
       'ACFT_MAKE_NAME', 'ACFT_MODEL_NAME', 'ACFT_MISSING_FLAG',
       'ACFT_DMG_DESC', 'FLT_ACTIVITY', 'FLT_PHASE', 'FAR_PART', 'MAX_INJ_LVL',
       'FATAL_FLAG', 'FLT_CRW_INJ_NONE', 'FLT_CRW_INJ_MINOR',
       'FLT_CRW_INJ_SERIOUS', 'FLT_CRW_INJ_FATAL', 'FLT_CRW_INJ_UNK',
       'CBN_CRW_INJ_NONE', 'CBN_CRW_INJ_MINOR', 'CBN_CRW_INJ_SERIOUS',
       'CBN_CRW_INJ_FATAL', 'CBN_CRW_INJ_UNK', 'PAX_INJ_NONE', 'PAX_INJ_MINOR',
       'PAX_INJ_SERIOUS', 'PAX_INJ_FATAL', 'PAX_INJ_UNK', 'GRND_INJ_NONE',
       'GRND_INJ_MINOR', 'GRND_INJ_SERIOUS', 'GRND_INJ_FATAL', 'GRND_INJ_UNK'],
      dtype='object')

In [56]:
# selecting required columns

In [57]:
df = dataset[['ACFT_MAKE_NAME','LOC_STATE_NAME','ACFT_MODEL_NAME',
             'RMK_TEXT','FLT_PHASE','EVENT_TYPE_DESC','FATAL_FLAG']]

In [58]:
# viewing first 5 rows

In [59]:
df.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,NaN
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,NaN
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,NaN
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,NaN

In [60]:
# replace NaN with No

In [61]:
df['FATAL_FLAG'].fillna(value='No',inplace=True)

/var/folders/tm/ffwlhhvs4hjbp97q0xdt53r80000gn/T/ipykernel_5253/2222978132.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FATAL_FLAG'].fillna(value='No',inplace=True)

In [62]:
df.head()

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
1,VANS,Florida,RV7,AIRCRAFT ON LANDING WENT OFF THE END OF THE RU...,LANDING (LDG),Incident,No
2,CESSNA,New Jersey,172,"AIRCRAFT ON FINAL SUSTAINED A BIRD STRIKE, LAN...",APPROACH (APR),Incident,No
3,LANCAIR,North Carolina,235,"AIRCRAFT ON LANDING, GEAR COLLAPSED, ASHEVILLE...",LANDING (LDG),Incident,No
4,CESSNA,Alaska,172,"AIRCRAFT ON LANDING, NOSE GEAR COLLAPSED, TALK...",LANDING (LDG),Incident,No

In [63]:
# view shape of dataset

In [64]:
df.shape

(83, 7)

In [65]:
df['ACFT_MAKE_NAME'].values

array(['BEECH', 'VANS', 'CESSNA', 'LANCAIR', 'CESSNA', 'BELL', 'PIPER',
       'CESSNA', 'BOEING', nan, 'CESSNA', nan, 'CESSNA', 'CESSNA',
       'BEECH', 'CESSNA', 'CHRISTEN', 'PIPER', 'PIPER', 'CESSNA',
       'HUGHES', 'CESSNA', nan, 'BOEING', 'GLOBE', 'PIPER', 'GREAT LAKES',
       'CESSNA', 'CONSOLIDATED VULTEE', 'CESSNA', 'BEECH', 'CESSNA',
       'FAIRCHILD', 'SOCATA', 'SAAB', 'EMBRAER', 'MAULE', 'ENSTROM',
       'BEECH', 'MOONEY', 'PITTS', 'CESSNA', 'CESSNA', 'CESSNA',
       'AEROSTAR INTERNATIONAL', 'CESSNA', 'CHAMPION', 'BELL', 'AIRBUS',
       'GRUMMAN', 'GULFSTREAM', 'SOCATA', 'CESSNA', 'PIPER', 'CESSNA',
       'FLIGHT DESIGN', 'PIPER', nan, nan, 'PIPER', 'PIPER', 'BEECH',
       'BEECH', 'CESSNA', 'CESSNA', 'CESSNA', 'PIPER', 'LANCAIR', 'BEECH',
       'MOONEY', 'AERO COMMANDER', 'CESSNA', 'MOONEY', 'BEECH',
       'SABRELINER', 'MOONEY', 'PIPER', 'BOEING', 'AERONCA',
       'NORTH AMERICAN', 'CHAMPION', 'BEECH', 'CESSNA'], dtype=object)

In [41]:
# drop rows where aircraft names are missing

In [68]:
df['ACFT_MAKE_NAME'].dropna(inplace=True)

/var/folders/tm/ffwlhhvs4hjbp97q0xdt53r80000gn/T/ipykernel_5253/2139931284.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['ACFT_MAKE_NAME'].dropna(inplace=True)

In [70]:
df.shape

(78, 7)

In [71]:
# groupby aircraft name

In [72]:
aircraftType = df.groupby('ACFT_MAKE_NAME')

In [74]:
aircraftType.size()

ACFT_MAKE_NAME
AERO COMMANDER             1
AERONCA                    1
AEROSTAR INTERNATIONAL     1
AIRBUS                     1
BEECH                      9
BELL                       2
BOEING                     3
CESSNA                    23
CHAMPION                   2
CHRISTEN                   1
CONSOLIDATED VULTEE        1
EMBRAER                    1
ENSTROM                    1
FAIRCHILD                  1
FLIGHT DESIGN              1
GLOBE                      1
GREAT LAKES                1
GRUMMAN                    1
GULFSTREAM                 1
HUGHES                     1
LANCAIR                    2
MAULE                      1
MOONEY                     4
NORTH AMERICAN             1
PIPER                     10
PITTS                      1
SAAB                       1
SABRELINER                 1
SOCATA                     2
VANS                       1
dtype: int64

In [79]:
# group the dataset by fatal flag

In [76]:
fatalAccidents = df.groupby('FATAL_FLAG')

In [78]:
fatalAccidents.size()

FATAL_FLAG
No     71
Yes     7
dtype: int64

In [80]:
# select the accidents with fatality with fatal flag yes

In [81]:
accidentsWithFatality = fatalAccidents.get_group('Yes')

In [82]:
accidentsWithFatality

,ACFT_MAKE_NAME,LOC_STATE_NAME,ACFT_MODEL_NAME,RMK_TEXT,FLT_PHASE,EVENT_TYPE_DESC,FATAL_FLAG
0,BEECH,North Carolina,36,"AIRCRAFT CRASHED INTO TREES, THE 1 PERSON ON B...",UNKNOWN (UNK),Accident,Yes
53,PIPER,Florida,PA28,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES. ...,UNKNOWN (UNK),Accident,Yes
55,FLIGHT DESIGN,California,CTLS,AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES A...,UNKNOWN (UNK),Accident,Yes
79,NORTH AMERICAN,Arizona,F51,"AIRCRAFT CRASHED UNDER UNKNOWN CIRCUMSTANCES, ...",UNKNOWN (UNK),Accident,Yes
80,CHAMPION,California,8KCAB,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
81,BEECH,California,35,"N9872R, BEECH M35 AIRCRAFT, AND N5057G, BELLAN...",UNKNOWN (UNK),Accident,Yes
82,CESSNA,Alabama,182,N784CP AIRCRAFT CRASHED INTO A WOODED AREA NEA...,UNKNOWN (UNK),Accident,Yes

## Problem Statement

### Analyze the Fire Department of New York City dataset using Pandas 

1. The total number of fire facilities in New York City
    
2. The number of fire department facilities in each borough

3. The names of facilities in Manhatten

In [84]:
# reading the datasets

In [83]:
dataset = pd.read_csv('datasets/FDNY_Firehouse_Listing.csv')

In [85]:
# viewing the content

In [86]:
dataset

,FacilityName,FacilityAddress,Borough,Postcode,Latitude,Longitude,Community Board,Community Council,Census Tract,BIN,BBL,NTA
0,Engine 4/Ladder 15,42 South Street,Manhattan,10005,40.703694,-74.007717,101,1,7,1000867,1000350001,Battery Park City-Lower Manhattan
1,Engine 6,49 Beekman Street,Manhattan,10038,40.709971,-74.005395,101,1,1501,1001287,1000930030,Battery Park City-Lower Manhattan
2,Manhattan Borough Command/Battalion 1/Engine 7...,100 Duane Street,Manhattan,10007,40.715339,-74.006300,101,1,33,1001647,1001500025,SoHo-TriBeCa-Civic Center-Little Italy
3,Ladder 8,14 N. Moore Street,Manhattan,10013,40.719574,-74.006620,101,1,33,1002150,1001890035,SoHo-TriBeCa-Civic Center-Little Italy
4,Engine 9/Ladder 6,75 Canal Street,Manhattan,10002,40.715408,-73.992834,103,1,16,1003898,1003000030,Chinatown
...,...,...,...,...,...,...,...,...,...,...,...,...
214,Engine 167/Ladder 87,345 Annadale Road,Staten Island,10312,40.554191,-74.175479,503,51,17012,5075428,5056420006,Annadale-Huguenot-Prince's Bay-Eltingville
215,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island,10312,40.535418,-74.196059,503,51,20804,5083491,5068280065,Rossville-Woodrow
216,Engine 151/Ladder 76,7219 Amboy Road,Staten Island,10307,40.512739,-74.238950,503,51,248,5089056,5080400010,Charleston-Richmond Valley-Tottenville
217,Engine 168,1100 Rossville Ave,Staten Island,10309,40.553942,-74.213083,503,51,20801,5154879,5070670252,Rossville-Woodrow
218,Marine 9,305 Front Street,Staten Island,10304,40.629954,-74.072430,501,49,21,5169276,5004870100,Stapleton-Rosebank

In [87]:
# selecting columns required

In [88]:
df = dataset[['FacilityName','FacilityAddress','Borough']]

In [91]:
# viewing the dataset

In [90]:
df.head()

,FacilityName,FacilityAddress,Borough
0,Engine 4/Ladder 15,42 South Street,Manhattan
1,Engine 6,49 Beekman Street,Manhattan
2,Manhattan Borough Command/Battalion 1/Engine 7...,100 Duane Street,Manhattan
3,Ladder 8,14 N. Moore Street,Manhattan
4,Engine 9/Ladder 6,75 Canal Street,Manhattan

In [113]:
# view the statistics - no of facilities in New York

In [94]:
df.describe()

              FacilityName  FacilityAddress   Borough
count                  219              219       219
unique                 219              219         5
top     Engine 4/Ladder 15  42 South Street  Brooklyn
freq                     1                1        66

In [95]:
# view number of records

In [96]:
df.count()

FacilityName       219
FacilityAddress    219
Borough            219
dtype: int64

In [97]:
# view data types

In [98]:
df.dtypes

FacilityName       object
FacilityAddress    object
Borough            object
dtype: object

In [99]:
# group by borough

In [100]:
boroughs = df.groupby('Borough')

In [104]:
# view information for each borough

In [105]:
boroughs.size()

Borough
Bronx            34
Brooklyn         66
Manhattan        48
Queens           51
Staten Island    20
dtype: int64

In [106]:
# select fdny info for manhatten

In [109]:
manhattan = boroughs.get_group('Manhattan')

In [112]:
manhattan.head()

,FacilityName,FacilityAddress,Borough
0,Engine 4/Ladder 15,42 South Street,Manhattan
1,Engine 6,49 Beekman Street,Manhattan
2,Manhattan Borough Command/Battalion 1/Engine 7...,100 Duane Street,Manhattan
3,Ladder 8,14 N. Moore Street,Manhattan
4,Engine 9/Ladder 6,75 Canal Street,Manhattan